tangyangguang/FarmAuto/apps/Esp32FarmDoor/src/FarmDoorApp.cpp
#include "FarmDoorApp.h"

#include <Arduino.h>
#include <Esp32At24cRecordStore.h>
#include <Esp32Base.h>
#include <Esp32EncodedDcMotor.h>
#include <Esp32MotorCurrentGuard.h>

#include <cstring>

#include "DoorController.h"
#include "DoorRecordLog.h"
#include "FarmDoorHardware.h"

namespace {

constexpr int64_t kDefaultOutputPulsesPerRev = 2096;
constexpr int64_t kDefaultOpenTurnsX100 = 500;
constexpr int64_t kDefaultOpenTargetPulses =
    (kDefaultOutputPulsesPerRev * kDefaultOpenTurnsX100) / 100;
constexpr int64_t kDefaultMaxRunPulses = (kDefaultOpenTargetPulses * 150) / 100;

DoorController g_door;
DoorRecordLog g_records;
DoorControllerConfig g_doorConfig;
Esp32EncodedDcMotor::MotorHardwareConfig g_motorHardware;
Esp32EncodedDcMotor::EncoderBackendConfig g_encoderBackend;
Esp32EncodedDcMotor::MotorKinematics g_motorKinematics;
Esp32EncodedDcMotor::MotorMotionProfile g_motorProfile;
Esp32EncodedDcMotor::MotorProtection g_motorProtection;
Esp32EncodedDcMotor::MotorStopPolicy g_motorStopPolicy;
Esp32MotorCurrentGuard::Ina240A2AnalogConfig g_currentSensor;
Esp32MotorCurrentGuard::MotorCurrentGuardConfig g_currentGuard;
Esp32At24cRecordStore::RecordStoreConfig g_recordStoreConfig;

static constexpr uint8_t kFarmDoorApiRouteCount = 11;
static_assert(ESP32BASE_WEB_MAX_ROUTES >= kFarmDoorApiRouteCount,
              "Esp32FarmDoor requires ESP32BASE_WEB_MAX_ROUTES >= 11");

bool ina240CompileEnabled() {
#if FARMAUTO_FARMDOOR_ENABLE_INA240A2
  return true;
#else
  return false;
#endif
}

const char* boolJson(bool value) {
  return value ? "true" : "false";
}

void sendDigitalField(const char* name, uint8_t value) {
  Esp32BaseWeb::sendChunk("\"");
  Esp32BaseWeb::sendChunk(name);
  Esp32BaseWeb::sendChunk("\":");
  Esp32BaseWeb::sendChunk(value == 1 ? "1" : "0");
}

void sendInt64(int64_t value) {
  char number[24];
  snprintf(number, sizeof(number), "%lld", static_cast<long long>(value));
  Esp32BaseWeb::sendChunk(number);
}

void sendUint32(uint32_t value) {
  char number[16];
  snprintf(number, sizeof(number), "%lu", static_cast<unsigned long>(value));
  Esp32BaseWeb::sendChunk(number);
}

const char* stateName(DoorState state) {
  switch (state) {
    case DoorState::PositionUnknown: return "PositionUnknown";
    case DoorState::IdleClosed: return "IdleClosed";
    case DoorState::IdleOpen: return "IdleOpen";
    case DoorState::IdlePartial: return "IdlePartial";
    case DoorState::Opening: return "Opening";
    case DoorState::Closing: return "Closing";
    case DoorState::Fault: return "Fault";
  }
  return "Unknown";
}

const char* commandName(DoorCommand command) {
  switch (command) {
    case DoorCommand::None: return "None";
    case DoorCommand::Open: return "Open";
    case DoorCommand::Close: return "Close";
    case DoorCommand::Stop: return "Stop";
  }
  return "Unknown";
}

const char* trustName(PositionTrustLevel trustLevel) {
  switch (trustLevel) {
    case PositionTrustLevel::Trusted: return "Trusted";
    case PositionTrustLevel::Limited: return "Limited";
    case PositionTrustLevel::Untrusted: return "Untrusted";
  }
  return "Untrusted";
}

const char* stopReasonName(DoorStopReason reason) {
  switch (reason) {
    case DoorStopReason::None: return "None";
    case DoorStopReason::TargetReached: return "TargetReached";
    case DoorStopReason::UserStop: return "UserStop";
    case DoorStopReason::ProtectiveStop: return "ProtectiveStop";
    case DoorStopReason::FaultStop: return "FaultStop";
  }
  return "Unknown";
}

const char* faultReasonName(DoorFaultReason reason) {
  switch (reason) {
    case DoorFaultReason::None: return "None";
    case DoorFaultReason::InvalidConfig: return "InvalidConfig";
    case DoorFaultReason::MotorFault: return "MotorFault";
    case DoorFaultReason::PositionLost: return "PositionLost";
  }
  return "Unknown";
}

const char* commandResultName(DoorCommandResult result) {
  switch (result) {
    case DoorCommandResult::Ok: return "Ok";
    case DoorCommandResult::Busy: return "Busy";
    case DoorCommandResult::InvalidArgument: return "InvalidArgument";
    case DoorCommandResult::PositionUntrusted: return "PositionUntrusted";
    case DoorCommandResult::FaultActive: return "FaultActive";
  }
  return "InvalidArgument";
}

const char* recordTypeName(DoorRecordType type) {
  switch (type) {
    case DoorRecordType::CommandRequested: return "DoorCommandRequested";
    case DoorRecordType::PositionSet: return "DoorPositionSet";
    case DoorRecordType::TravelSet: return "DoorTravelSet";
    case DoorRecordType::TravelAdjusted: return "DoorTravelAdjusted";
    case DoorRecordType::FaultCleared: return "DoorFaultCleared";
  }
  return "UnknownEvent";
}

const char* recordResultName(DoorRecordResult result) {
  switch (result) {
    case DoorRecordResult::Ok: return "Ok";
    case DoorRecordResult::Busy: return "Busy";
    case DoorRecordResult::InvalidArgument: return "InvalidArgument";
    case DoorRecordResult::PositionUntrusted: return "PositionUntrusted";
    case DoorRecordResult::FaultActive: return "FaultActive";
  }
  return "InvalidArgument";
}

int httpCodeFor(DoorCommandResult result) {
  switch (result) {
    case DoorCommandResult::Ok: return 200;
    case DoorCommandResult::Busy: return 409;
    case DoorCommandResult::PositionUntrusted: return 409;
    case DoorCommandResult::FaultActive: return 409;
    case DoorCommandResult::InvalidArgument: return 400;
  }
  return 400;
}

uint16_t positionPercent(const DoorSnapshot& snapshot) {
  if (snapshot.openTargetPulses <= 0) {
    return 0;
  }
  int64_t percent = (snapshot.positionPulses * 100) / snapshot.openTargetPulses;
  if (percent < 0) {
    percent = 0;
  }
  if (percent > 120) {
    percent = 120;
  }
  return static_cast<uint16_t>(percent);
}

bool readInt64Param(const char* name, int64_t& out) {
  char raw[24];
  if (!Esp32BaseWeb::getParam(name, raw, sizeof(raw))) {
    return false;
  }
  char* end = nullptr;
  const long long value = strtoll(raw, &end, 10);
  if (!end || *end != '\0') {
    return false;
  }
  out = static_cast<int64_t>(value);
  return true;
}

bool hasParam(const char* name) {
  char raw[2];
  return Esp32BaseWeb::getParam(name, raw, sizeof(raw));
}

